from proxy.utils import decrypt


if __name__ == "__main__":
    print("彩虹島物語封包解密工具")
    try:
        while True:
            encrypted_data = input("[input]:   ")
            try:
                decrypted_data = decrypt(bytes.fromhex(encrypted_data))
            except ValueError:
                continue
            else:
                print("[output]: ", decrypted_data.hex(" ").upper())
    except KeyboardInterrupt:
        print("\n感謝使用")


# 14 00 01 00 F4 C3 EB 0B 08 00 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 F4 C3 EB 0B 00 00 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 F4 C3 EB 0B 00 10 00 00 00 00 00 00 00 00 00 00

# 右
# 14 00 01 00 F4 C3 EB 0B 00 30 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 F4 C3 EB 0B 00 10 00 00 00 00 00 00 00 00 00 00

# 左
# 14 00 01 00 F4 C3 EB 0B 00 28 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 F4 C3 EB 0B 00 08 00 00 00 00 00 00 00 00 00 00

# 14 00 01 00 85 AE 8D 6A 00 44 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 85 AE 8D 6A 00 64 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 85 AE 8D 6A 00 44 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 85 AE 8D 6A 00 64 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 85 AE 8D 6A 00 44 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 85 AE 8D 6A 00 64 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 85 AE 8D 6A 00 44 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 85 AE 8D 6A 00 64 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 85 AE 8D 6A 00 44 00 00 00 00 00 00 00 00 00 00
# 14 00 01 00 85 AE 8D 6A 00 64 00 00 00 00 00 00 00 00 00 00


# 動作->道具拾取: 包裹序號=42114, 包裹ID=814000000, 道具序號=0, 道具ID=170407201, 背包類型=消費, 背包序號=16
# 1A 00 01 00 86 C5 EB 0B 82 A4 00 00 80 A7 84 30 00 21 35 28 0A 01 00 00 00 10
# 動作->道具拾取: 包裹序號=42107, 包裹ID=814000000, 道具序號=0, 道具ID=170140201, 背包類型=消費, 背包序號=17
# 1A 00 01 00 86 C5 EB 0B 7B A4 00 00 80 A7 84 30 00 29 22 24 0A 01 00 00 00 11
